{
  "jdTitle": "Full Stack Web Developer",
  "jdCompany": "Canadian Appliance Source",
  "jdAddress": "Etobicoke, ON",
  "jdDes": "<p>Are you struggling to shine in an Agile development environment? Well if you&#x2019;d like to embrace the freedom of productivity and put your talents to use, we are the place for you! If you&#x2019;re comfortable working with patterns of procedural style PHP and have the drive to complete work in a self-sufficient manner, then we&#x2019;re looking for you!</p><p>Come grow with us. Canadian Appliance Source is looking for a new addition to its talented web development team.</p><p>As an integral member of our team, you will be helping every department of the company thrive from a technological standpoint, helping to develop our fully-custom software: both the back-end system and front-end website, in sales, warehousing, logistics, accounting, customer-facing interfaces, and more!</p><p><b>Skill requirements: </b></p><ul><li>PHP [4+ years]</li></ul><ul><li>MySQL [4+ years]</li></ul><ul><li>Linux server administration</li></ul><ul><li>JavaScript (jQuery)</li></ul><ul><li>HTML, CSS and web design</li></ul><ul><li>Bilingual French/English an asse<b>t</b></li></ul><p><b>Benefits</b></p><ul><li>Company paid benefit package after 90 days</li></ul><ul><li>Grow with one of Canada&apos;s Fastest Growing Company&apos;s 2019 - Growth 500 list</li></ul><ul><li>Competitive compensation package</li></ul><ul><li>Opportunity to work side by side with highly skilled developers</li></ul><ul><li>Monthly company perks such as birthday events, health &amp; wellness days, team events</li></ul><p><b>Job Requirements: </b></p><ul><li>Ability to multi-task and work on multiple projects at a time</li></ul><ul><li>Self starter that can prioritize projects to meet the needs of stakeholders</li></ul><ul><li>Ability to architect efficient solutions that integrate with existing code</li></ul><ul><li>Creating, deploying, and maintaining your own code</li></ul><ul><li>Effective time management and superior organizational skills</li></ul><ul><li>Demonstrated ability to solve complex problems</li></ul><p><b>The Nice-to-Haves: </b></p><ul><li>Experience working with/developing eCommerce websites.</li></ul><ul><li>Experience developing for all levels of logistics throughout a retailer supply chain.</li></ul><ul><li>Impressive Photoshop skills with an eye for design in all the work you produce &#x2013; creative.</li></ul><p>All candidates may be subject to a background check. Mandatory Non-Disclosure Agreement upon signing. Hiring conditional on successful completion of aptitude test and technological skills test.</p><p><b>Canadian Appliance Source is an equal opportunity employer. We uphold and respect the requirements set forth in the Accessibility for Ontarians with Disabilities Act (2005) and its associated standards and regulations. Should you require accommodation during the recruitment and hire process, please notify us.</b></p><p>Benefits:</p><ul><li>Extended health care</li><li>Vision care</li><li>Company events &amp; social hours</li><li>Dental care</li><li>Disability insurance</li><li>On-site parking</li></ul><p>Job Types: Full-time, Permanent</p>"
}